/**
 * Создание игры Жизнь
 * @param _sizeX {number} - число колонок
 * @param _sizeY {number} - число строк
 * @param _htmlElement {HTMLElement} - элемент, в котором будет отрисована игра
 * @returns void
 */
export function drawField(_sizeX, _sizeY, _htmlElement) {
  // Создать блок для поля
  // Создать кнопку управления игрой
  // Создать поле заданного размера
  // Отрисовать поле заданного размера
  // При клике по ячейке поля
  // - поменять его состояние
  // - перерисовать поле
  // При клике по кнопке старт
  // - поменять надпись на `Stop`
  // - запустить таймер для обновления поля
  // При клике на кнопке `Stop` остановить таймер
  // В таймере обновления поля
  // - посчитать новое состояние поля
  // - отрисовать новое состояние поля
  // - проверить, что есть живые клетки
  // - если живых клеток нет
  //    - остановить таймер
  //    - вывести сообщение
}
